// LAB-6.3.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
// LAB_06_3.cpp
// Сушинський Ігор
// Лабораторна робота № 6.3
// Опрацювання одновимірних масивів за допомогою звичайних функцій та шаблонів.
// Варіант 20
// Ітераційний спосіб

#include <iostream>

using namespace std;

int main()
{
    int a[10] = { 1,13,7,4,11,32,47,29,9,55 };
    int max = 0;

    for (int i = 0; i < 10; i++)
    {
        if (max < a[i])
        {
            max = a[i];
        }
    }

    cout << "Max = " << max << endl;

    return 0;
}